Services/src/InformationRegisters/С_КоробкиФайл/С_КоробкиФайл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>С_КоробкиФайл</name>
  <dimensions>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.С_Конфигурации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Services/src/Catalogs/С_Конфигурации/С_Конфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>С_Конфигурации</name>
  <predefined>
    <items>
      <name>УправлениеПредприятиемДляБеларуси</name>
      <description>ERP Управление предприятием 2 для Беларуси</description>
    </items>
    <items>
      <name>БухгалтерияДляБеларуси</name>
      <description>Бухгалтерия для Беларуси</description>
    </items>
    <items>
      <name>Документооборот</name>
      <description>Документооборот КОРП для Беларуси</description>
    </items>
    <items>
      <name>ЗарплатаУправлениеПерсоналомДляБеларуси</name>
      <description>Зарплата управление персоналом для Беларуси</description>
    </items>
    <items>
      <name>РозницаДляБеларуси</name>
      <description>Розница для Беларуси</description>
    </items>
    <items>
      <name>УправлениеНебольшойФирмойДляБеларуси</name>
      <description>Управление небольшой фирмой для Беларуси</description>
    </items>
    <items>
      <name>УПП</name>
      <description>Управление производственным предприятием для беларуси</description>
    </items>
    <items>
      <name>УправлениеТорговлейДляБеларуси</name>
      <description>Управление торговлей для Беларуси</description>
    </items>
    <items>
      <name>УправлениеТорговлейДляБеларуси_CRM</name>
      <description>Управление торговлей для беларуси CRM</description>
    </items>
  </predefined>
</mdclass:Catalog>

Services/src/InformationRegisters/С_КоробкиФайл/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ВыборФайлаДляВыгрузкиИЗагрузки(Элементы.ФайлЗагрузки);

	ЗагрузитьНаСервере();
	
КонецПроцедуры
	
Процедура загрузитьнаСервере()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Попытка
		ТабличныйДокумент.Прочитать(ФайлЗагрузки, СпособЧтенияЗначенийТабличногоДокумента.Значение);    
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;
	
	КолвоСтрокФайла = ТабличныйДокумент.ВысотаТаблицы-1;
	
	Если КолвоСтрокФайла = 0 Тогда
		ТабличныйДокумент = Неопределено;
	КонецЕсли;
	Текущаядата = текущаядата();	
	
	РегНомер = "";
	Конфигурация = "";

	Для ит = 5 ПО КолвоСтрокФайла Цикл
		
		нстр = СтрЗаменить(ит, Символы.НПП, "");
		Если ит > 100 И ТабличныйДокумент.ПолучитьОбласть("R"+ нстр + "C1").ТекущаяОбласть.Текст = "" Тогда
			Прервать;
		КонецЕсли;
				
		текст =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R"+ нстр + "C1").ТекущаяОбласть.Текст);
		Если  Найти(текст, "Бухг")<> 0 Тогда
			Конфигурация = Справочники.С_Конфигурации.БухгалтерияДляБеларуси;
		ИначеЕсли 	Найти(текст, "торг")<> 0 Тогда
			Конфигурация = Справочники.С_Конфигурации.УправлениеТорговлейДляБеларуси;
		ИначеЕсли 	Найти(текст, "торг")<> 0 Тогда
			Конфигурация = Справочники.С_Конфигурации.УправлениеТорговлейДляБеларуси;
	
		ИначеЕсли 	Найти(текст, "небольш")<> 0 Тогда
			Конфигурация = Справочники.С_Конфигурации.УправлениеНебольшойФирмойДляБеларуси;
	    ИначеЕсли 	Найти(текст, "Розн")<> 0 Тогда
			Конфигурация = Справочники.С_Конфигурации.РозницаДляБеларуси;
		 ИначеЕсли 	Найти(текст, "Зарпл")<> 0 Тогда
			Конфигурация = Справочники.С_Конфигурации.ЗарплатаУправлениеПерсоналомДляБеларуси;
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьТолькоЦифрыВСтроке(текст) Тогда
			РегНомер = текст;
		Иначе
			Сообщить("Строка " + Строка(ит) + текст);
			Продолжить;
		КонецЕсли;
		
		Если   РегНомер = "" Тогда
			Продолжить;
		КонецЕсли;	
		сообщить("Отработана запись" + строка(ит));
		НаборЗаписей = РегистрыСведений.С_КоробкиФайл.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РегистрационныйНомер.Установить(РегНомер);
		НаборЗаписей.Отбор.Конфигурация.Установить(Конфигурация);
		НаборЗаписей.Прочитать();
		
		Если  НаборЗаписей.Количество() > 0 Тогда
			Сообщить("Количество больше 0=" + Строка(РегНомер)); 
		КонецЕсли;	
		НаборЗаписей.Очистить();
		
		ЗАпись = НаборЗаписей.Добавить();
		ЗАпись.Период = Текущаядата;
		ЗАпись.Конфигурация = Конфигурация;
		ЗАпись.РегистрационныйНомер = РегНомер;
		Попытка
			НаборЗаписей.Записать();
		Исключение
			сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		РегНомер = "";
		
		//Конфигурация = "";

	КонецЦикла;	
				

	
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыборФайлаДляВыгрузкиИЗагрузки(Элемент) Экспорт
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	//ДиалогВыбора.Фильтр                      = НСтр("ru = 'Файл'") + " (*.xls)|*.xls";
	ДиалогВыбора.Заголовок                   = НСтр("ru = 'Выберите файл данных по коробкам'");
	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	//ДиалогВыбора.Расширение                  = "xls";
	ДиалогВыбора.ИндексФильтра               = 0;
	//ДиалогВыбора.ПолноеИмяФайла              = Элемент.ТекстРедактирования;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбора.Выбрать() Тогда
		ФайлЗагрузки = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры
